RoSchmi/Esp32_WiFiManager_HeatingSurvey/src/main.cpp
// Program 'Esp32_WiFiManager_HeatingSurvey' Branch Master
#define PROGRAMVERSION "v1.2.1(b)"
// Last updated: 2024_07_24
// Copyright: RoSchmi 2021, 2024 License: Apache 2.0
// the App was tested only on ESP32, not sure if it works on variations of ESP32
// or ESP8266

// Now uses
// platform espressif32@6.7.0 and platform_package framework-arduinoespressif32 @ 3.20017.0
// Switched to built-in Filesystem 'LittleFS' instead of 'LITTLEFS'
//
// In cases of a wrong (old) format of the LittleFS flash storage,
// the flash must be cleared with the command (cmd window)
// python C:\Users\<user>\.platformio\packages\tool-esptoolpy\esptool.py erase_flash

// If you still have problems with formatting the flash for LittleFS, try to use
// https://github.com/RoSchmi/ESP32_LittleFS_Simple_Formatter

// Definition of your TimeZone has to be made in config.h
// Original Timezone_Generic library by Khoih-prog is not used
// (didn't take the time to understand) instead I used a modification
// which is part of this App (lib/RoSchmi/RSTimeZone/src)

// The application doesn't compile without a trick:
// The libraries NTPClient_Generic and Timezone_Generic load the
// dependency:
// {
//      "owner": "khoih-prog",
//      "name": "ESP8266_AT_WebServer",
//      "version": ">=1.5.4",
//      "platforms": ["*"]
//    },
// This dependency doesn't compile. So we delete in folder libdeps/ESP32 
// the dependency in the 'library.json' file and delete the entry 
// 'ESP8266_AT_WebServer' in the folder libdeps/ESP32


// This App for Esp32 monitors the activity of the burner of an oil-heating
// (or any other noisy thing) by measuring the sound of e.g. the heating burner 
// using an I2S microphone (Adafruit SPH0645 or INMP441)
// The on/off states are transferred to the Cloud (Azure Storage Tables)
// via WLAN and internet and can be visulized graphically through the iPhone- or Android-App
// Charts4Azure.
// The Router-WiFi Credentials can be entered via a Captive Portal page which is provided for one minute
// by the Esp32 after powering up the device. After having entered the credentials
// one time they stay permanently on the Esp32 and need not to be entered every time.

// This App uses an adaption of the 'Async_ConfigOnStartup.ino' as WiFi Mangager
// from: -https://github.com/khoih-prog/ESPAsync_WiFiManager 
// More infos about the functions and Licenses see:
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/blob/master/examples/Async_ConfigOnDoubleReset_Multi
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/tree/master/examples/Async_ConfigOnStartup
 

// The WiFiManager will open a configuration portal in the WLAN Access-Point for 60 seconds when powered up 
// if the boards has stored WiFi Credentials, otherwise, the Access Point will stay indefinitely in ConfigPortal 
// until the Router WiFi Credentials are entered.
// The Name (SSID) of the Access Point is e.g. ESP32_xxxxxx, if a password is requested (only the first time),
// the passwort is "My" + the SSID-Name, e.g. MyESP32_xxxxxx.
 
#include <Arduino.h>
#include <time.h>
#include "ESPAsyncWebServer.h"
#include "defines.h"
#include "config.h"
#include "DateTime.h"
#include <freertos/FreeRTOS.h>
#include "Esp.h"
#include "esp_task_wdt.h"
#include <rom/rtc.h>

#include "CloudStorageAccount.h"
#include "TableClient.h"
#include "TableEntityProperty.h"
#include "TableEntity.h"
#include "AnalogTableEntity.h"
#include "OnOffTableEntity.h"

#include "NTPClient_Generic.h"
#include "Timezone_Generic.h"
#include "WiFiUdp.h"
#include "WiFiClient.h"
#include "HTTPClient.h"

#include "DataContainerWio.h"
#include "OnOffDataContainerWio.h"
#include "OnOffSwitcherWio.h"
#include "SoundSwitcher.h"
#include "ImuManagerWio.h"
#include "AnalogSensorMgr.h"

#include "azure/core/az_platform.h"
#include "azure/core/az_http.h"
#include "azure/core/az_http_transport.h"
#include "azure/core/az_result.h"
#include "azure/core/az_config.h"
#include "azure/core/az_context.h"
#include "azure/core/az_span.h"

#include "Rs_TimeNameHelper.h"

// Now support ArduinoJson 6.0.0+ ( tested with v6.14.1 )
#include "ArduinoJson.h"      // get it from https://arduinojson.org/ or install via Arduino library manager

// Default Esp32 stack size of 8192 byte is not enough for this application.
// --> configure stack size dynamically from code to 16384
// https://community.platformio.org/t/esp32-stack-configuration-reloaded/20994/4

SET_LOOP_TASK_STACK_SIZE ( 16*1024 ); // 16KB

// Allocate memory space in memory segment .dram0.bss, ptr to this memory space is later
// passed to TableClient (is used there as the place for some buffers to preserve stack )
uint8_t bufferStore[4000] {0};
uint8_t * bufferStorePtr = &bufferStore[0];

// void * StackPtrAtStart;
// void * StackPtrEnd;
UBaseType_t * StackPtrAtStart;
UBaseType_t * StackPtrEnd;

UBaseType_t watermarkStart;
TaskHandle_t taskHandle_0 =  xTaskGetCurrentTaskHandleForCPU(0);
TaskHandle_t taskHandle_1 =  xTaskGetCurrentTaskHandleForCPU(1);

bool watchDogEnabled = false;
bool watchDogCommandSuccessful = false;

RESET_REASON resetReason_0;
RESET_REASON resetReason_1;

uint8_t lastResetCause = 0;

#define GPIOPin 0
bool buttonPressed = false;

const char analogTableName[45] = ANALOG_TABLENAME;

const char OnOffTableName_1[45] = ON_OFF_TABLENAME_01;
const char OnOffTableName_2[45] = ON_OFF_TABLENAME_02;
const char OnOffTableName_3[45] = ON_OFF_TABLENAME_03;
const char OnOffTableName_4[45] = ON_OFF_TABLENAME_04;

// The PartitionKey for the analog table may have a prefix to be distinguished, here: "Y2_" 
const char * analogTablePartPrefix = (char *)ANALOG_TABLE_PART_PREFIX;

// The PartitionKey for the On/Off-tables may have a prefix to be distinguished, here: "Y3_" 
const char * onOffTablePartPrefix = (char *)ON_OFF_TABLE_PART_PREFIX;

// The PartitinKey can be augmented with a string representing year and month (recommended)
const bool augmentPartitionKey = true;

// The TableName can be augmented with the actual year (recommended)
const bool augmentTableNameWithYear = true;

typedef const char* X509Certificate;

// https://techcommunity.microsoft.com/t5/azure-storage/azure-storage-tls-critical-changes-are-almost-here-and-why-you/ba-p/2741581
// baltimore_root_ca will expire in 2025, then take digicert_globalroot_g2_ca
//X509Certificate myX509Certificate = baltimore_root_ca;

X509Certificate myX509Certificate = digicert_globalroot_g2_ca;

// Init the Secure client object

#if TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

  // A UDP instance to let us send and receive packets over UDP
  WiFiUDP ntpUDP;
  static NTPClient timeClient(ntpUDP);
  
  HTTPClient http;
  
  // Ptr to HTTPClient
  static HTTPClient * httpPtr = &http;
  
// Define Datacontainer with SendInterval and InvalidateInterval as defined in config.h
int sendIntervalSeconds = (SENDINTERVAL_MINUTES * 60) < 1 ? 1 : (SENDINTERVAL_MINUTES * 60);

